{
  "backend/main.mo": "Empty Motoko actor with no functionality implemented.",
  "feature_evidence.json": "Feature evidence report documenting 7 implemented features including heading changes, 3D model updates, and gesture-to-action mappings with voice feedback for hand gestures.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, and utilities for the hand gesture-controlled 3D robot application.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS custom properties for light and dark themes with cyan/blue accent colors.",
  "frontend/index.html": "HTML entry point loading MediaPipe Hands, Framer Motion CDN scripts, and mounting the React application at #root.",
  "frontend/src/App.tsx": "Main application component with \"Cyber Puppet\" heading, managing gesture detection, cursor position, sound toggle, and instructions modal with dark gradient background and social footer.",
  "frontend/src/components/CameraPreview.tsx": "Camera preview component integrating useCamera, useHandDetection, and useGestureActions hooks to display video feed with hand landmark overlays and propagate gesture/cursor data to parent.",
  "frontend/src/components/ControlButtons.tsx": "Control buttons component with neon styling for toggling sound on/off and showing instructions modal.",
  "frontend/src/components/GestureStatus.tsx": "Status display component showing current detected gesture with emoji badges and labels for 7 gesture types (yay, peace, love, wave, rock, thumbsup, fist).",
  "frontend/src/components/InstructionsModal.tsx": "A modal dialog component that displays a scrollable list of 7 hand gesture controls (Yay, Peace Bro, I Love You, Hi Buddy, Yo Yo, Good Job, Come On Fight) with their finger positions, voice commands, and robot actions.",
  "frontend/src/components/LoadingScreen.tsx": "A full-screen loading component with an animated spinner and text indicating initialization of 3D models and AI detection for the Virtual Mouse application.",
  "frontend/src/components/RobotModel.tsx": "A Three.js-based 3D robot component that animates based on gesture input, including jump, rotate, clap, wave, and movement animations using React Three Fiber and animation mixers.",
  "frontend/src/components/VirtualCursor.tsx": "A fixed-position visual cursor component that smoothly follows a provided position with a glowing circular design and transition animations.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that manages the ICP backend actor instance, creating authenticated or anonymous actors based on Internet Identity and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useAudioFeedback.ts": "A hook that provides text-to-speech functionality using the Web Speech API, with voice selection and the ability to enable/disable audio feedback.",
  "frontend/src/hooks/useGestureActions.ts": "A hook that triggers voice feedback for different gesture types (yay, peace, love, wave, rock, thumbsup, fist) when gestures change, using the audio feedback hook.",
  "frontend/src/hooks/useHandDetection.ts": "A hook that uses MediaPipe Hands to detect hand landmarks from video, recognizes gestures, and tracks the index finger tip position with throttled gesture updates every 500ms.",
  "frontend/src/hooks/useInternetIdentity.ts": "A React context provider and hook for Internet Identity authentication on ICP, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "An intentionally empty file placeholder indicating that all functionality is handled client-side with no backend queries needed.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using OKLCH color space, defining design tokens for colors, borders, and shadows, plus custom neon-button component with shimmer animation.",
  "frontend/src/main.tsx": "React application entry point that sets up the root render with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/utils/gestureRecognizer.ts": "Hand gesture recognition utility that analyzes 21 hand landmarks to detect 7 gesture types (fist, thumbsup, yay, peace, love, rock, wave) based on finger extension patterns.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH color system, container settings, border radius variables, neon shadows, and custom animations (accordion, shimmer) using typography and animate plugins.",
  "project_state.json": "Project metadata describing a hand gesture-controlled virtual mouse web app called 'Cyber Puppet' with Three.js 3D robot, MediaPipe hand tracking, 7 gesture patterns, voice feedback, and rotating turntable display."
}