{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report documenting two optimization features for RobotModel.tsx: improving animation speed/responsiveness and removing autonomous rotation.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, utilities, and configuration for the Cyber Puppet hand gesture control application.",
  "frontend/index.css": "Tailwind CSS base styles with OKLCH color system defining CSS custom properties for light and dark themes.",
  "frontend/index.html": "HTML entry point loading MediaPipe Hands, Framer Motion CDN scripts, and mounting the React application.",
  "frontend/src/App.tsx": "Main application component managing gesture state, cursor position, sound, and instructions with header, 3D robot, camera preview, controls, and footer layout.",
  "frontend/src/components/CameraPreview.tsx": "Camera preview component integrating useCamera, useHandDetection, and useGestureActions hooks to detect gestures and track cursor position from video feed.",
  "frontend/src/components/ControlButtons.tsx": "Control buttons component with sound toggle and instructions modal trigger using neon-styled buttons.",
  "frontend/src/components/GestureStatus.tsx": "Status display component showing the currently detected gesture with emoji badges and labels.",
  "frontend/src/components/InstructionsModal.tsx": "Modal dialog displaying all seven supported hand gestures with their finger positions, voice feedback, and robot actions.",
  "frontend/src/components/LoadingScreen.tsx": "Loading screen with animated spinner and gradient text shown during initial asset loading.",
  "frontend/src/components/RobotModel.tsx": "React Three Fiber component that renders an animated 3D robot responding to hand gestures (yay, peace, love, wave, rock, thumbsup, fist) with corresponding animations like jumping, rotating, clapping, and waving.",
  "frontend/src/components/VirtualCursor.tsx": "Renders a visual cursor overlay at specified screen coordinates with a glowing blue circular design and smooth transform transitions.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP backend actor, switching between authenticated and anonymous actors based on Internet Identity login state.",
  "frontend/src/hooks/useAudioFeedback.ts": "Hook that provides text-to-speech functionality using the Web Speech API, with voice selection and enable/disable control.",
  "frontend/src/hooks/useGestureActions.ts": "Hook that triggers audio feedback (speech) when gesture types change, mapping each gesture to a specific spoken phrase.",
  "frontend/src/hooks/useHandDetection.ts": "Hook that uses MediaPipe Hands to detect hand landmarks from video, recognizes gestures with multi-frame confirmation, and tracks the index finger tip position.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout state and identity persistence using the DFINITY AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating all functionality is handled client-side with no backend queries.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light/dark themes, neon button styles with shimmer animation, and base typography settings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/utils/gestureRecognizer.ts": "Recognizes hand gestures from MediaPipe landmarks by analyzing finger extension states (tip vs joint positions) to detect 7 gesture types: fist, thumbsup, yay, peace, love, rock, and wave.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended animations (accordion, shimmer), custom shadows (neon), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata for 'Cyber Puppet' - a hand gesture-controlled virtual mouse web app with Three.js 3D robot, MediaPipe gesture detection, voice feedback, and 7 gesture patterns including love, yay, peace, thumbsup, fist, wave, and rock gestures."
}